app/controllers/admin/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("title", "description", "quantity", "price", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "ew"], ["description", "e"], ["quantity", 1], ["price", 1], ["created_at", 2019-11-10 01:23:30 UTC], ["updated_at", 2019-11-10 01:23:30 UTC], ["image", "数据可视化.png"]]